---
kind: other
id: Properties.T:Autodesk.Revit.DB.Architecture.ContinuousRailType
source: html/da579d31-2df6-510d-5c9d-d710c41bbabb.htm
---
# ContinuousRailType Properties

The id of the assembly instance to which the element belongs.